atomvm/AtomVM/src/platforms/esp32/main/socket_driver.c
    GlobalContext *glb = ctx->global;
    struct ESP32PlatformData *platform = glb->platform_data;

    struct netconn *conn = netconn_new_with_proto_and_callback(NETCONN_UDP, 0, socket_callback);
    // TODO check for invalid return
    socket_data->conn = conn;

    term ret = do_bind(ctx, params);

    socket_data->active = active;
    if (ret == OK_ATOM && active == TRUE_ATOM) {
        EventListener *listener = malloc(sizeof(EventListener));
        if (IS_NULL_PTR(listener)) {
            fprintf(stderr, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            abort();
        }
        listener->sender = conn;
        listener->expires = 0;
        listener->expiral_timestamp.tv_sec = INT_MAX;
        listener->expiral_timestamp.tv_nsec = INT_MAX;
        listener->one_shot = 0;
        listener->data = ctx;
        listener->handler = active_recvfrom_callback;
        list_append(&platform->listeners, &listener->listeners_list_head);
        socket_data->active_listener = listener;
        TRACE("socket: initialized\n");
    } else {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }
    return ret;
}

static term do_connect(SocketDriverData *socket_data, Context *ctx, term address, term port)
{
    // TODO handle IP addresses
    if (!term_is_list(address)) {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }

    int ok;
    char *addr_str = interop_term_to_string(address, &ok);
    if (!ok) {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }
    TRACE("socket_driver: resolving %s ...\n", addr_str);

    struct ip_addr remote_ip;
    err_t status = netconn_gethostbyname(addr_str, &remote_ip);

    free(addr_str);

    if (status != ERR_OK) {
        // TODO atom
        return port_create_sys_error_tuple(ctx, UNDEFINED_ATOM, status);
    }

    int port_val = term_to_int(port);

    TRACE("socket_driver: connecting to port %i ...\n", port_val);
    status = netconn_connect(socket_data->conn, &remote_ip, port_val);

    if (status != ERR_OK) {
        // TODO atom
        return port_create_sys_error_tuple(ctx, CONNECT_ATOM, status);
    } else {
        TRACE("socket_driver: connected.\n");
        return OK_ATOM;
    }
}

static term init_client_tcp_socket(Context *ctx, SocketDriverData *socket_data, term params, term active)
{
    TRACE("socket: creating client tcp netconn\n");

    GlobalContext *glb = ctx->global;
    struct ESP32PlatformData *platform = glb->platform_data;

    struct netconn *conn = netconn_new_with_proto_and_callback(NETCONN_TCP, 0, socket_callback);
    // TODO check for invalid return
    socket_data->conn = conn;

    term address = interop_proplist_get_value(params, ADDRESS_ATOM);
    term port = interop_proplist_get_value(params, PORT_ATOM);
    term ret = do_connect(socket_data, ctx, address, port);
    if (ret != OK_ATOM) {
        // TODO
        // close(sockfd);
    } else {
        if (active == TRUE_ATOM) {
            EventListener *listener = malloc(sizeof(EventListener));
            if (IS_NULL_PTR(listener)) {
                fprintf(stderr, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
                abort();
            }
            listener->sender = conn;
            listener->expires = 0;
            listener->expiral_timestamp.tv_sec = INT_MAX;
            listener->expiral_timestamp.tv_nsec = INT_MAX;
            listener->one_shot = 0;
            listener->data = ctx;
            listener->handler = active_recv_callback;
            list_append(&platform->listeners, &listener->listeners_list_head);
            socket_data->active_listener = listener;
        }
    }
    return ret;
}

static term do_listen(SocketDriverData *socket_data, Context *ctx, term params)
{
    term backlog = interop_proplist_get_value(params, BACKLOG_ATOM);
    if (!term_is_integer(backlog)) {
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }
    err_t status = netconn_listen_with_backlog(socket_data->conn, term_to_int(backlog));
    if (status == -1) {
        return port_create_sys_error_tuple(ctx, LISTEN_ATOM, errno);
    } else {
        return OK_ATOM;
    }
}

static term init_server_tcp_socket(Context *ctx, SocketDriverData *socket_data, term params)
{
    TRACE("socket: creating server tcp netconn\n");

    struct netconn *conn = netconn_new_with_proto_and_callback(NETCONN_TCP, 0, socket_callback);
    // TODO check for invalid return
    socket_data->conn = conn;

    term ret = do_bind(ctx, params);
    if (ret != OK_ATOM) {
        // TODO close
        // close(conn);
    } else {
        ret = do_listen(socket_data, ctx, params);
        if (ret != OK_ATOM) {
        // TODO close
        // close(conn);
        } else {
            // netconn_set_nonblocking(conn, 1);
            TRACE("socket: listening on port %u\n", (unsigned) term_to_int(interop_proplist_get_value(params, PORT_ATOM)));
        }
    }
    return ret;
}

static term init_accepting_socket(Context *ctx, SocketDriverData *socket_data, term fd_term, term active)
{
    TRACE("socket: init_accepting_socket\n");

    GlobalContext *glb = ctx->global;
    struct ESP32PlatformData *platform = glb->platform_data;

    socket_data->conn = (struct netconn *) fds[term_to_int(fd_term)];
    //
    //
    //
    if (active == TRUE_ATOM) {
        EventListener *listener = malloc(sizeof(EventListener));
        if (IS_NULL_PTR(listener)) {
            fprintf(stderr, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            abort();
        }
        listener->sender = socket_data->conn;
        listener->expires = 0;
        listener->expiral_timestamp.tv_sec = INT_MAX;
        listener->expiral_timestamp.tv_nsec = INT_MAX;
        listener->one_shot = 0;
        listener->data = ctx;
        listener->handler = active_recv_callback;
        list_append(&platform->listeners, &listener->listeners_list_head);
        socket_data->active_listener = listener;
    }
    return OK_ATOM;
}

term socket_driver_do_init(Context *ctx, term params)
{
    TRACE("socket: init\n");

    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;

