atomvm/AtomVM/src/platforms/esp32/main/socket_driver.c
static void accept_callback(EventListener *listener)
{
    TRACE("socket: accepting callback\n");

    RecvFromData *recvfrom_data = (RecvFromData *) listener->data;
    Context *ctx = recvfrom_data->ctx;
    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;

    GlobalContext *glb = ctx->global;
    struct ESP32PlatformData *platform = glb->platform_data;

    //
    // accept the connection
    //
    struct netconn *conn;
    err_t status = netconn_accept(socket_data->conn, &conn);
    int this_fd = next_fd;
    next_fd++;
    fds[this_fd] = conn;
    TRACE("socket: netconn_accept: status: %i; conn: 0x%lx\n", status, (unsigned long) conn);
    if (status != ERR_OK) {
        // {Ref, {error, {SysCall, Errno}}}
        port_ensure_available(ctx, 12);
        term pid = recvfrom_data->pid;
        term ref = term_from_ref_ticks(recvfrom_data->ref_ticks, ctx);
        port_send_reply(ctx, pid, ref, port_create_sys_error_tuple(ctx, ACCEPT_ATOM, errno));
    } else {
        TRACE("socket: accepted new connection\n");
        // {Ref, {ok, Fd::int()}}
        port_ensure_available(ctx, 10);
        term pid = recvfrom_data->pid;
        term ref = term_from_ref_ticks(recvfrom_data->ref_ticks, ctx);
        term reply = port_create_ok_tuple(ctx, term_from_int(this_fd));
        TRACE("socket: sending reply\n");
        port_send_reply(ctx, pid, ref, reply);
    }
    //
    // remove the EventListener from the global list and clean up
    //
    list_remove(&listener->listeners_list_head);
    free(listener);
    free(recvfrom_data);
    TRACE("socket: accept_callback done.\n");
}

void socket_driver_do_accept(Context *ctx, term pid, term ref, term timeout)
{
    GlobalContext *glb = ctx->global;
    struct ESP32PlatformData *platform = glb->platform_data;

    TRACE("socket: accepting tcp netconn\n");

    SocketDriverData *socket_data = (SocketDriverData *) ctx->platform_data;
    //
    // Create and initialize the request-specific data
    //
    RecvFromData *data = (RecvFromData *) malloc(sizeof(RecvFromData));
    if (IS_NULL_PTR(data)) {
        fprintf(stderr, "Unable to allocate space for RecvFromData: %s:%i\n", __FILE__, __LINE__);
        abort();
    }
    data->ctx = ctx;
    data->pid = pid;
    data->length = 0;
    data->ref_ticks = term_to_ref_ticks(ref);

    //
    // Create an event listener with this request-specific data, and append to the global list
    //
    EventListener *listener = malloc(sizeof(EventListener));
    if (IS_NULL_PTR(listener)) {
        fprintf(stderr, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
        abort();
    }
    listener->sender = socket_data->conn;
    listener->expires = 0;
    listener->expiral_timestamp.tv_sec = 60*60*24; // TODO handle timeout
    listener->expiral_timestamp.tv_nsec = 0;
    listener->one_shot = 1;
    listener->handler = accept_callback;
    listener->data = data;
    list_append(&platform->listeners, &listener->listeners_list_head);
    TRACE("socket: accepting tcp netconn COMPLETE\n");
}

// TODO define in defaultatoms
const char *const send_a = "\x4" "send";
const char *const sendto_a = "\x6" "sendto";
const char *const init_a = "\x4" "init";
const char *const bind_a = "\x4" "bind";
const char *const recvfrom_a = "\x8" "recvfrom";
const char *const recv_a = "\x4" "recv";
const char *const close_a = "\x5" "close";
const char *const get_port_a = "\x8" "get_port";
const char *const accept_a = "\x6" "accept";

static void socket_consume_mailbox(Context *ctx)
{
    TRACE("START socket_consume_mailbox\n");
    if (UNLIKELY(ctx->native_handler != socket_consume_mailbox)) {
        abort();
    }

    port_ensure_available(ctx, 16);

    Message *message = mailbox_dequeue(ctx);
    term     msg = message->message;
    term     pid = term_get_tuple_element(msg, 0);
    term     ref = term_get_tuple_element(msg, 1);
    term     cmd = term_get_tuple_element(msg, 2);

    term cmd_name = term_get_tuple_element(cmd, 0);
    if (cmd_name == context_make_atom(ctx, init_a)) {
        term params = term_get_tuple_element(cmd, 1);
        term reply = socket_driver_do_init(ctx, params);
        port_send_reply(ctx, pid, ref, reply);
        if (reply != OK_ATOM) {
            // TODO handle shutdown
            // socket_driver_delete_data(ctx->platform_data);
            // context_destroy(ctx);
        }
    } else if (cmd_name == context_make_atom(ctx, sendto_a)) {
        term dest_address = term_get_tuple_element(cmd, 1);
        term dest_port = term_get_tuple_element(cmd, 2);
        term buffer = term_get_tuple_element(cmd, 3);
        term reply = socket_driver_do_sendto(ctx, dest_address, dest_port, buffer);
        port_send_reply(ctx, pid, ref, reply);
    } else if (cmd_name == context_make_atom(ctx, send_a)) {
        term buffer = term_get_tuple_element(cmd, 1);
        term reply = socket_driver_do_send(ctx, buffer);
        port_send_reply(ctx, pid, ref, reply);
    } else if (cmd_name == context_make_atom(ctx, recvfrom_a)) {
        term length = term_get_tuple_element(cmd, 1);
        term timeout = term_get_tuple_element(cmd, 2);
        socket_driver_do_recvfrom(ctx, pid, ref, length, timeout);
    } else if (cmd_name == context_make_atom(ctx, recv_a)) {
        term length = term_get_tuple_element(cmd, 1);
        term timeout = term_get_tuple_element(cmd, 2);
        socket_driver_do_recv(ctx, pid, ref, length, timeout);
    } else if (cmd_name == context_make_atom(ctx, accept_a)) {
        term timeout = term_get_tuple_element(cmd, 1);
        socket_driver_do_accept(ctx, pid, ref, timeout);
    } else if (cmd_name == context_make_atom(ctx, close_a)) {
        socket_driver_do_close(ctx);
        port_send_reply(ctx, pid, ref, OK_ATOM);
        // TODO handle shutdown
        // socket_driver_delete_data(ctx->platform_data);
        // context_destroy(ctx);
    } else if (cmd_name == context_make_atom(ctx, get_port_a)) {
        term reply = socket_driver_get_port(ctx);
        port_send_reply(ctx, pid, ref, reply);
    } else {
        port_send_reply(ctx, pid, ref, port_create_error_tuple(ctx, BADARG_ATOM));
    }

    free(message);
    TRACE("END socket_consume_mailbox\n");
}

void socket_init(Context *ctx, term opts)
{
    UNUSED(opts);
    void *data = socket_driver_create_data();
    ctx->native_handler = socket_consume_mailbox;
    ctx->platform_data = data;
}
